&НаКлиенте
Процедура ЗаказКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Заказ.ТекущиеДанные;
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Стоимость;
	РассчитатьСуммуЗакупки();
КонецПроцедуры

&НаКлиенте
Процедура ЗаказСтоимостьПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Заказ.ТекущиеДанные;
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Стоимость;
	РассчитатьСуммуЗакупки();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуЗакупки()
	Объект.Сумма = 0;
	Для Каждого Строка Из Объект.Заказ Цикл
		Объект.Сумма = Объект.Сумма + Строка.Сумма;
	КонецЦикла;
КонецПроцедуры