
&НаСервере
Процедура ЗаявкаПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Объект.Заявка) Тогда
		ДанныеЗаявки      = Объект.Заявка.ПолучитьОбъект();
		Объект.Клиент     = ДанныеЗаявки.Клиент;
		Объект.Специалист = ДанныеЗаявки.Специалист;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПриИзменении(Элемент)
	ЗаявкаПриИзмененииНаСервере();
КонецПроцедуры



&НаКлиенте
Процедура РаботыКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Работы.ТекущиеДанные;
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Стоимость;
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура РаботыСтоимостьПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Работы.ТекущиеДанные;
	СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Стоимость;
	РассчитатьСумму();
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСумму()
	Объект.Сумма = 0;
	Для Каждого Строка Из Объект.Работы Цикл
		Объект.Сумма = Объект.Сумма + Строка.Сумма;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РаботыНоменклатураПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Работы.ТекущиеДанные;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	СтрокаТЧ.Стоимость = РаботыПолучитьСтоимостьНаСервере(
		СтрокаТЧ.Номенклатура);
КонецПроцедуры

&НаСервере
Функция РаботыПолучитьСтоимостьНаСервере(Номенклатура)
	Если ТипЗнч(Номенклатура) = 
			Тип("СправочникСсылка.КаталогУслуг") Тогда
		Возврат Номенклатура.Стоимость;
		
	ИначеЕсли ТипЗнч(Номенклатура) = 
			Тип("СправочникСсылка.ТоварыНаСкладе") Тогда
		Возврат Номенклатура.Стоимость;
	КонецЕсли;
	
	Возврат 0;
КонецФункции